system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0) //0
    (0.5 0 0) //1
    (4 0 0) //2
    (15 0 0) //3
    (0 2 -0.087321886) //4
    (0.5 2 -0.087321886) //5
    (4 0.75 -0.032745707) //6
    (15 0.75 -0.032745707) //7
    (0 2.5 -0.10915236) //8
    (0.5 2.5 -0.10915236) //9
    (4 2.5 -0.10915236) //10
    (15 2.5 -0.10915236) //11
    (0 2 0.087321886) //12
    (0.5 2 0.087321886) //13
    (4 0.75 0.032745707) //14
    (15 0.75 0.032745707) //15
    (0 2.5 0.10915236) //16
    (0.5 2.5 0.10915236) //17
    (4 2.5 0.10915236) //18
    (15 2.5 0.10915236) //19
);

blocks
(
    hex (0 1 5 4 0 1 13 12) (15 30 1) simpleGrading (1 0.5 1)
    hex (2 3 7 6 2 3 15 14) (110 15 1) simpleGrading (1.5 1 1)
    hex (4 5 9 8 12 13 17 16) (15 15 1) simpleGrading (1 1 1)
    hex (5 6 10 9 13 14 18 17) (50 15 1) simpleGrading (1 1 1)
    hex (6 7 11 10 14 15 19 18) (110 15 1) simpleGrading (1.5 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 0 12 4)
            (4 12 16 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 15 3)
            (7 11 19 15)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (9 17 18 10)
            (8 16 17 9)
            (10 18 19 11)
        );
    }
    movingWall
    {
        type wall;
        faces
        (
            (1 5 13 1)
            (5 6 14 13)
            (2 2 14 6)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 4 5 1)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
            (12 13 17 16)
            (13 14 18 17)
            (14 15 19 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
